// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "林君瑶包子我滴爱：",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "今天是一个了不起的日子哦↑",  // 同上...
        "是小猪最爱最爱滴小宝",
        "破壳日10000天！！！耶耶耶",
        "和小宝在一起以来",
        "我见过你美丽的样子",
        "跳舞的样子",
        "可爱的样子~",
        "可爱的样子~~",
        "还有可爱的样子~~~",
        "都是我喜欢的样子",
        "虽然小猪",
        "没能从这10000天的开始出现",
        "但是小猪会爱宝",
        "照顾宝",
        "在今后的，每一天",
        "From: 爱你的小猪",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "我见过你美丽的样子": "./imgs/mei.png",
        "跳舞的样子": "./imgs/dance.png",
        "可爱的样子~": "./imgs/ke3.png",
        "可爱的样子~~": "./imgs/ke2.png",
        "还有可爱的样子~~~": "./imgs/ke1.png",
        "From: 爱你的小猪": "./imgs/zhu.png",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "请小宝点击~",
        play: "奏乐！",
        bannar_coming: "来点颜色！",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "小宝破壳一万天啦！",
        story: "点开看看哦↑",
    }
};
